if `uname -v`.include? "RELEASE_ARM64"
  unless `arch`.include? "arm64"
    raise "Please run brew bundle within arm64 arch!"
  end
end

tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
tap "narze/taps"
tap "yqrashawn/goku"

brew "awscli"
brew "bat"
# brew "diff-so-fancy"
brew "ffmpeg"
brew "ghq"
brew "git"
brew "git-delta"
brew "git-flow"
brew "jq"
brew "mackup"
brew "magic-wormhole"
brew "mas"
brew "mpc"
brew "mpd"
brew "ncmpcpp"
brew "neofetch"
brew "reattach-to-user-namespace"
brew "terminal-notifier"
brew "tldr"
brew "tmux"
brew "tree"
brew "watch"
brew "zsh"

brew "gh"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "yqrashawn/goku/goku"

cask "1password"
cask "alfred"
# cask "arq" # Wait for v5 compatability
cask "beardedspice"
cask "bitbar"
cask "dash"
cask "docker"
cask "dropbox"
cask "firefox"
cask "flux"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fantasque-sans-mono"
cask "font-fantasque-sans-mono-nerd-font"
cask "google-backup-and-sync"
cask "google-chrome"
cask "hazel"
cask "joplin"
cask "kitty"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "ngrok"
cask "omnifocus"
cask "postgres"
cask "postman"
cask "rescuetime"
cask "setapp"
cask "slack"
cask "spotify"
cask "startupizer"
cask "syncthing"
cask "telegram"
cask "the-unarchiver"
cask "visual-studio-code"
cask "whatpulse"
