tap "homebrew/cask-fonts"

brew "neovim"
brew "ghq"
brew "git-delta"
brew "github/gh/gh"
brew "yqrashawn/goku/goku"
brew "zoxide"

cask "1password"
cask "alfred"
cask "dash"
cask "font-fantasquesansmono-nerd-font"
cask "kitty"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "notion"
cask "omnifocus"
cask "spotify"
cask "syncthing"
