tap "buo/cask-upgrade"
tap "candid82/brew"
tap "danielbayley/alfred"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "narze/taps"
tap "osx-cross/avr"
tap "puma/puma"
tap "px4/px4"
tap "wagoodman/dive"
tap "wtfutil/wtfutil"
tap "yqrashawn/goku"

brew "ansible"
brew "avrdude"
brew "awscli"
brew "bat"
brew "certbot"
brew "cmake"
brew "dfu-programmer"
brew "dfu-util"
brew "diff-so-fancy"
brew "elasticsearch@2.4", link: true
brew "entr"
brew "exercism"
brew "fd"
brew "ffmpeg"
brew "fontforge"
brew "fzf"
brew "fzy"
brew "ghq"
brew "git"
brew "git-flow"
brew "git-hooks"
brew "hub"
brew "imagemagick", link: false
brew "imagemagick@6", link: true
brew "jq"
brew "kubernetes-helm"
brew "mackup"
brew "magic-wormhole"
brew "mas"
brew "memcached"
brew "minikube"
brew "mkcert"
brew "most"
brew "mpc"
brew "mpd"
brew "multitail"
brew "nativefier"
brew "ncmpcpp"
brew "neofetch"
brew "neovim"
brew "reattach-to-user-namespace"
brew "terminal-notifier"
brew "tldr"
brew "tmux"
brew "watch"
brew "wtfutil"
brew "zsh"

brew "github/gh/ghs"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "osx-cross/avr/avr-gcc@8", link: true
brew "puma/puma/puma-dev"
brew "px4/px4/gcc-arm-none-eabi"
brew "wagoodman/dive/dive"
brew "yqrashawn/goku/goku"

cask "1password"
cask "alfred"
cask "android-file-transfer"
cask "arduino"
cask "arq"
cask "bitbar"
cask "brave-browser"
cask "ccleaner"
cask "chromedriver"
cask "dash"
cask "default-folder-x"
cask "discord"
cask "disk-inventory-x"
cask "docker"
cask "dropbox"
cask "evernote"
cask "firefox"
cask "flux"
cask "font-firacode-nerd-font"
cask "franz"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-cloud-sdk"
cask "growlnotify"
cask "hazel"
cask "iterm2"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "libreoffice"
cask "megasync"
cask "ngrok"
cask "notable"
cask "notion"
cask "omnifocus"
cask "postgres"
cask "postman"
cask "qmk-toolbox"
cask "recordit"
cask "rescuetime"
cask "selfcontrol"
cask "setapp"
cask "shortcat"
cask "slack"
cask "spotify"
cask "startupizer"
cask "steam"
cask "synergy"
cask "teamviewer"
cask "telegram"
cask "the-unarchiver"
cask "virtualbox"
cask "visual-studio-code"
cask "xld"
cask "xquartz"
cask "whatpulse"
cask "zerotier-one"

mas "Amphetamine", id: 937984704
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Browserism", id: 979047768
mas "Fantastical", id: 975937182
mas "Helium", id: 1054607607
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "SnippetsLab", id: 1006087419
mas "Spark", id: 1176895641
mas "Trello", id: 1278508951
mas "Tweetbot", id: 557168941
