tap "buo/cask-upgrade"
tap "candid82/brew"
tap "danielbayley/alfred"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "narze/taps"
tap "osx-cross/avr"
tap "puma/puma"
tap "px4/px4"
tap "wagoodman/dive"
tap "wtfutil/wtfutil"

brew "ansible"
brew "avrdude"
brew "awsebcli"
brew "certbot"
brew "cmake"
brew "dfu-programmer"
brew "dfu-util"
brew "entr"
brew "exercism"
brew "fd"
brew "fontforge"
brew "git-hooks"
brew "hub"
brew "hugo"
brew "imagemagick", link: false
brew "imagemagick@6", link: true
brew "kubernetes-helm"
brew "memcached"
brew "minikube"
brew "mkcert"
brew "most"
brew "multitail"
brew "nativefier"
brew "wtfutil"

brew "osx-cross/avr/avr-gcc@8", link: true
brew "puma/puma/puma-dev"
brew "px4/px4/gcc-arm-none-eabi"
brew "wagoodman/dive/dive"

cask "android-file-transfer"
cask "arduino"
cask "brave-browser"
cask "ccleaner"
cask "chromedriver"
cask "default-folder-x"
cask "discord"
cask "disk-inventory-x"
cask "evernote"
cask "franz"
cask "google-cloud-sdk"
cask "growlnotify"
cask "kitty"
cask "libreoffice"
cask "megasync"
cask "microsoft-edge"
cask "notable"
cask "notion"
cask "qmk-toolbox"
cask "recordit"
cask "selfcontrol"
cask "shortcat"
cask "steam"
cask "synergy"
cask "teamviewer"
cask "virtualbox"
cask "xld"
cask "xquartz"
cask "zerotier-one"

mas "Amphetamine", id: 937984704
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Browserism", id: 979047768
mas "Fantastical", id: 975937182
mas "Helium", id: 1054607607
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "SnippetsLab", id: 1006087419
mas "Spark", id: 1176895641
mas "Trello", id: 1278508951
mas "Tweetbot", id: 557168941
