if `uname -v`.include? "RELEASE_ARM64"
  unless `arch`.include? "arm64"
    raise "Please run brew bundle within arm64 arch!"
  end
end

tap "homebrew/cask-fonts"

brew "ghq"
brew "git-delta"
brew "gh"
brew "yqrashawn/goku/goku"
brew "zoxide"

cask "1password"
cask "alfred"
cask "dash"
cask "font-fantasque-sans-mono-nerd-font"
cask "kitty"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "notion"
cask "omnifocus"
cask "spotify"
cask "syncthing"
